# Criação de colunas e operações
***

A criação de colunas e a realização de operações são tarefas essenciais na manipulação e transformação de dados no Pandas. Nesse contexto, o Pandas oferece algumas ferramentas úteis, como os métodos assign, transform e apply, que permitem adicionar novas colunas aos DataFrames e aplicar operações em linhas ou colunas existentes.

### Importação das bibliotecas

In [1]:
import numpy as np
import pandas as pd

### Criando  dataframe a partir de uma lista em Python

In [2]:
dados = {'Nome': ['Maria', 'João', 'Ana'],
        'Idade': [25, 32, 28]}

df = pd.DataFrame(dados)
df.head()

    Nome  Idade
0  Maria     25
1   João     32
2    Ana     28

### Método assign
***
O método assign permite criar novas colunas em um DataFrame, atribuindo a elas valores específicos ou realizando operações com base em colunas existentes. Podemos usar expressões lambda ou funções para definir a lógica por trás da criação dessas colunas.

### lambda
Uma expressão lambda, também conhecida como função lambda, é uma forma concisa de definir uma função anônima em Python. Ao contrário das funções tradicionais, que são definidas usando a palavra-chave def, as expressões lambda são definidas usando a palavra-chave lambda, seguida por um ou mais argumentos separados por vírgulas, dois pontos :, e a expressão a ser executada.

A sintaxe básica de uma expressão lambda é a seguinte:

> lambda argumentos: expressão

As expressões lambda são frequentemente usadas em situações em que é necessário definir uma função simples e de curta duração, como em operações de filtragem, mapeamento e redução de dados. Elas podem ser usadas diretamente em chamadas de funções, atribuições de variáveis ou em qualquer contexto onde uma função seja esperada.

A principal vantagem das expressões lambda é a sua concisão e legibilidade, pois permitem definir funções em linha sem a necessidade de criar uma função separada.

> square = lambda x: x ** 2

Nesse caso, a expressão lambda recebe um argumento x e retorna o valor de x elevado ao quadrado.

In [4]:
# Adicionar uma nova coluna usando assign
df = df.assign(Ano_Nascimento=lambda x: 2023 - x['Idade'])
df.head()

    Nome  Idade  Ano_Nascimento
0  Maria     25            1998
1   João     32            1991
2    Ana     28            1995

### Método transform
***
Já o método transform é útil quando queremos aplicar uma operação em grupos de linhas com base em uma determinada coluna. Essa operação é aplicada a cada grupo individualmente e os resultados são retornados com o mesmo tamanho do DataFrame original. Por exemplo:

In [6]:
dados = {'Grupo': ['A', 'B', 'A', 'B'],
        'Valor': [10, 20, 30, 40]}

df = pd.DataFrame(dados)

# Aplicar uma operação de média por grupo usando transform
df['Media_Grupo'] = df.groupby('Grupo')['Valor'].transform('mean')

df

  Grupo  Valor  Media_Grupo
0     A     10         20.0
1     B     20         30.0
2     A     30         20.0
3     B     40         30.0

### Método apply
***
Ométodo apply é usado para aplicar uma função a cada linha ou coluna de um DataFrame. Podemos usar funções definidas por nós mesmos ou funções built-in do Python.

In [16]:
dados = {'Valor1': [10, 20, 30],
        'Valor2': [5, 10, 15]}

df = pd.DataFrame(dados)
df.head()

   Valor1  Valor2
0      10       5
1      20      10
2      30      15

In [17]:
# Aplicar uma função de multiplicação a cada valor usando apply
df['Resultado'] = df.apply(lambda row: row['Valor1'] * row['Valor2'], axis=1)

df.head()

   Valor1  Valor2  Resultado
0      10       5         50
1      20      10        200
2      30      15        450

In [19]:
def verifica_resultado(Resultado):
    if Resultado >= 200:
        return 'Vendas acima de 200'
    else:
        return 'Vendas abaixo de 200'

# Aplicar a função usando o método apply
df['Avaliação de Vendas'] = df['Resultado'].apply(verifica_resultado)

df.head()

   Valor1  Valor2  Resultado   Avaliação de Vendas
0      10       5         50  Vendas abaixo de 200
1      20      10        200   Vendas acima de 200
2      30      15        450   Vendas acima de 200